lab4/app/views/countries/index.html.erb

    <td><%= country.name %></td>
    <td><%= country.airports.count %></td>
---
SELECT COUNT(*) FROM "airports" WHERE "airports"."country_id" = ?  [["country_id", 1]]