lab4/app/views/index/index.html.erb

SELECT "airports".* FROM "airports"
---
    <label for="airport_from">Airport from</label>
    <%= select_tag 'airport_from', options_from_collection_for_select(Airport.all, 'id', 'name'), class: 'form-control' %>