lab4/app/views/airports/_form.html.erb

  <%= f.input :city %>
  <%= f.input :country_id, collection: Country.all %>
---
SELECT "countries".* FROM "countries"