lab4/app/controllers/airports_controller.rb

  def index
    @airports = Airport.all
---
SELECT "airports".* FROM "airports"

  def create
    @airport = Airport.new(airport_params)

    if @airport.save
---
INSERT INTO "airports" ("name", "city", "country_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "fsdfsd"], ["city", "sdfsdf"], ["country_id", 1], ["created_at", "2018-04-25 00:00:35.060227"], ["updated_at", "2018-04-25 00:00:35.060227"]]

  def update
    if @airport.update(airport_params)
---
UPDATE "airports" SET "country_id" = ?, "updated_at" = ? WHERE "airports"."id" = ?  [["country_id", 3], ["updated_at", "2018-04-24 23:51:16.382766"], ["id", 1]]

  def find_airport
    @airport = Airport.find(params[:id])
---
SELECT  "airports".* FROM "airports" WHERE "airports"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]