lab4/app/controllers/countries_controller.rb

  def index
    @countries = Country.all
---
SELECT "countries".* FROM "countries"

  def create
    @country = Country.new(country_params)

    if @country.save
---
INSERT INTO "countries" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Test"], ["created_at", "2018-04-24 22:37:30.719411"], ["updated_at", "2018-04-24 22:37:30.719411"]]

  def destroy
    if @country.destroy
---
DELETE FROM "countries" WHERE "countries"."id" = ?  [["id", 2]]

  def find_country
    @country = Country.find(params[:id])
---
SELECT  "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]