lab4/app/controllers/index_controller.rb

SELECT "trips".* FROM "trips" WHERE (airport_from_id = '1' and airport_to_id = '2') ORDER BY "trips"."time_out" ASC
---
  def index
    @results = []
    if params[:commit]
      @results = Trip.where('airport_from_id = :from and airport_to_id = :to', from: params[:airport_from], to: params[:airport_to]).order(time_out: :asc)